In [1]:
import numpy as np

In [2]:
mylist = [1, 3, 5, 7, 6, 8]

array = np.array(mylist)

array

array([1, 3, 5, 7, 6, 8])

In [3]:
type(array)

numpy.ndarray

In [4]:
array.ndim

1

In [5]:
array.shape

(6,)

In [6]:
array.size

6

In [7]:
np.ones(4)

array([1., 1., 1., 1.])

In [16]:
np.ones((3,5))

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [8]:
np.zeros(5)

array([0., 0., 0., 0., 0.])

In [19]:
np.zeros((3,6))

array([[0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0.]])

In [9]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [20]:
np.arange(0, 20, 3)

array([ 0,  3,  6,  9, 12, 15, 18])

In [23]:
np.arange(0, 30, 6)

array([ 0,  6, 12, 18, 24])

In [14]:
np.linspace(0, 20, 6)

array([ 0.,  4.,  8., 12., 16., 20.])

In [24]:
np.arange(1, 9, 2).reshape(2, 2)

array([[1, 3],
       [5, 7]])

In [28]:
np.arange(10, 110, 10).reshape(5, 2)

array([[ 10,  20],
       [ 30,  40],
       [ 50,  60],
       [ 70,  80],
       [ 90, 100]])

In [29]:
ss = np.arange(10, 110, 10).reshape(5, 2)

In [32]:
np.where(ss > 30, 'yes', ss)

array([['10', '20'],
       ['30', 'yes'],
       ['yes', 'yes'],
       ['yes', 'yes'],
       ['yes', 'yes']], dtype='<U11')

## Use Case

In [1]:
import pandas as pd
location  = "C:\\Users\\MSampathVinayKumarRe\\Desktop\\Python\\DSA\\data\\Pandas Course Resources\\project_data"

In [2]:
transactions = pd.read_csv("{}\\project_transactions.csv".format(location), 
                          dtype = {"DAY": "Int16",
                                   "QUANTITY": "Int32",
                                   "STORE_ID": "Int32",
                                   "WEEK_NO": "Int8"}
                          )

In [3]:
transactions.head(5)

,household_key,BASKET_ID,DAY,PRODUCT_ID,QUANTITY,SALES_VALUE,STORE_ID,RETAIL_DISC,WEEK_NO,COUPON_DISC,COUPON_MATCH_DISC
0,1364,26984896261,1,842930,1,2.19,31742,0.00,1,0.0,0.0
1,1364,26984896261,1,897044,1,2.99,31742,-0.40,1,0.0,0.0
2,1364,26984896261,1,920955,1,3.09,31742,0.00,1,0.0,0.0
3,1364,26984896261,1,937406,1,2.50,31742,-0.99,1,0.0,0.0
4,1364,26984896261,1,981760,1,0.60,31742,-0.79,1,0.0,0.0

In [4]:
transactions.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2146311 entries, 0 to 2146310
Data columns (total 11 columns):
 #   Column             Dtype
---  ------             -----
 0   household_key      int64
 1   BASKET_ID          int64
 2   DAY                Int16
 3   PRODUCT_ID         int64
 4   QUANTITY           Int32
 5   SALES_VALUE        float64
 6   STORE_ID           Int32
 7   RETAIL_DISC        float64
 8   WEEK_NO            Int8
 9   COUPON_DISC        float64
 10  COUPON_MATCH_DISC  float64
dtypes: Int16(1), Int32(2), Int8(1), float64(4), int64(3)
memory usage: 145.3 MB

In [5]:
transactions.describe().round()

,household_key,BASKET_ID,DAY,PRODUCT_ID,QUANTITY,SALES_VALUE,STORE_ID,RETAIL_DISC,WEEK_NO,COUPON_DISC,COUPON_MATCH_DISC
count,2146311.0,2.146311e+06,2146311.0,2146311.0,2146311.0,2146311.0,2146311.0,2146311.0,2146311.0,2146311.0,2146311.0
mean,1056.0,3.404897e+10,390.0,2884715.0,101.0,3.0,-734.0,-1.0,56.0,-0.0,-0.0
std,605.0,4.723748e+09,190.0,3831949.0,1152.0,4.0,9122.0,1.0,27.0,0.0,0.0
min,1.0,2.698490e+10,1.0,25671.0,0.0,0.0,1.0,-130.0,1.0,-56.0,-8.0
25%,548.0,3.040798e+10,229.0,917231.0,1.0,1.0,330.0,-1.0,33.0,0.0,0.0
50%,1042.0,3.281176e+10,392.0,1027960.0,1.0,2.0,372.0,0.0,57.0,0.0,0.0
75%,1581.0,4.012804e+10,555.0,1132771.0,1.0,3.0,422.0,0.0,80.0,0.0,0.0
max,2099.0,4.230536e+10,711.0,18316298.0,89638.0,840.0,34280.0,4.0,102.0,0.0,0.0

In [6]:
transactions.isna().sum()

household_key        0
BASKET_ID            0
DAY                  0
PRODUCT_ID           0
QUANTITY             0
SALES_VALUE          0
STORE_ID             0
RETAIL_DISC          0
WEEK_NO              0
COUPON_DISC          0
COUPON_MATCH_DISC    0
dtype: int64

In [7]:
transactions["STORE_ID"].describe()

count    2.146311e+06
mean    -7.342462e+02
std      9.122392e+03
min      1.000000e+00
25%      3.300000e+02
50%      3.720000e+02
75%      4.220000e+02
max      3.428000e+04
Name: STORE_ID, dtype: float64

In [8]:
transactions = (transactions.assign(total_discount = transactions["RETAIL_DISC"] + transactions["COUPON_DISC"],
                             percentage_discount = (lambda x : (x["total_discount"]/x["SALES_VALUE"]).abs()))
                             .drop(["RETAIL_DISC", "COUPON_DISC", "COUPON_MATCH_DISC"], axis = 1))

In [9]:
transactions.head()

,household_key,BASKET_ID,DAY,PRODUCT_ID,QUANTITY,SALES_VALUE,STORE_ID,WEEK_NO,total_discount,percentage_discount
0,1364,26984896261,1,842930,1,2.19,31742,1,0.00,0.000000
1,1364,26984896261,1,897044,1,2.99,31742,1,-0.40,0.133779
2,1364,26984896261,1,920955,1,3.09,31742,1,0.00,0.000000
3,1364,26984896261,1,937406,1,2.50,31742,1,-0.99,0.396000
4,1364,26984896261,1,981760,1,0.60,31742,1,-0.79,1.316667

In [10]:
transactions["percentage_discount"] = (transactions["percentage_discount"]
                                       .where(transactions["percentage_discount"] < 1, 1.0)
                                       .where(transactions["percentage_discount"] > 0, 0)
                                      )
transactions.head()

,household_key,BASKET_ID,DAY,PRODUCT_ID,QUANTITY,SALES_VALUE,STORE_ID,WEEK_NO,total_discount,percentage_discount
0,1364,26984896261,1,842930,1,2.19,31742,1,0.00,0.000000
1,1364,26984896261,1,897044,1,2.99,31742,1,-0.40,0.133779
2,1364,26984896261,1,920955,1,3.09,31742,1,0.00,0.000000
3,1364,26984896261,1,937406,1,2.50,31742,1,-0.99,0.396000
4,1364,26984896261,1,981760,1,0.60,31742,1,-0.79,1.000000

In [11]:
transactions["percentage_discount"].mean()

0.20732444073964212

In [12]:
transactions["SALES_VALUE"].sum()

6666243.499999999

In [13]:
transactions["total_discount"].sum()

-1178658.0799999998

In [14]:
transactions["QUANTITY"].sum()

216713611

In [15]:
transactions["QUANTITY"].max()

89638

In [19]:
#getting the row with max QUANTITY
transactions.loc[transactions["QUANTITY"].argmax()]

household_key                  630.0
BASKET_ID              34749153595.0
DAY                            503.0
PRODUCT_ID                 6534178.0
QUANTITY                     89638.0
SALES_VALUE                    250.0
STORE_ID                       384.0
WEEK_NO                         73.0
total_discount                -13.45
percentage_discount           0.0538
Name: 1442095, dtype: Float64

In [22]:
# all unique values
transactions["BASKET_ID"].unique()

array([26984896261, 26984905972, 26984945254, ..., 42302712189,
       42305362497, 42305362535], dtype=int64)

In [27]:
transactions["BASKET_ID"].nunique()

232939

In [38]:
top10_values = (transactions
                .groupby("household_key")
                .agg({"SALES_VALUE" : "sum"})
                .sort_values("SALES_VALUE", ascending= False)
                .iloc[:10])

top10_values

               SALES_VALUE
household_key
1023              38319.79
1609              27859.68
1453              21661.29
1430              20352.99
718               19299.86
707               19194.42
1653              19153.75
1111              18894.72
982               18790.34
400               18494.14

In [39]:
top10_quant = (transactions
                .groupby("household_key")
                .agg({"QUANTITY" : "sum"})
                .sort_values("QUANTITY", ascending= False)
                .iloc[:10])

top10_quant

               QUANTITY
household_key
1023            4479917
755             3141769
1609            2146715
13              1863829
1430            1741892
1527            1734632
1762            1669880
707             1640193
1029            1496204
1314            1492863

In [41]:
top10_prods = (transactions
               .groupby("PRODUCT_ID")
               .agg({"SALES_VALUE" : "sum"})
               .sort_values("SALES_VALUE", ascending = False)
               .iloc[:10]
              ) 
                
top10_prods

            SALES_VALUE
PRODUCT_ID
6534178       420154.13
6533889        42339.31
1029743        33894.75
1082185        24149.79
6533765        23831.14
6534166        23755.70
1106523        22931.01
916122         22749.02
995242         21229.72
5569230        20051.95

In [1]:
import numpy as np
import pandas as pd

In [2]:
list_ = list('abcdefghijklmnopqrstuvwxyz')
array_ = np.arange(26)
dict_ = dict(zip(list_, array_))

print(dict_)

{'a': 0, 'b': 1, 'c': 2, 'd': 3, 'e': 4, 'f': 5, 'g': 6, 'h': 7, 'i': 8, 'j': 9, 'k': 10, 'l': 11, 'm': 12, 'n': 13, 'o': 14, 'p': 15, 'q': 16, 'r': 17, 's': 18, 't': 19, 'u': 20, 'v': 21, 'w': 22, 'x': 23, 'y': 24, 'z': 25}

In [3]:
pd.Series(dict_)

a     0
b     1
c     2
d     3
e     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int32

In [4]:
ser1, ser2 = pd.Series(list('abcdefghijklmnopqrstuvwxyz')), pd.Series(np.arange(26))

In [5]:
df = pd.concat([ser1, ser2], axis=1)
df.columns = ["Alphs", "Digi"]
df.head()

  Alphs  Digi
0     a     0
1     b     1
2     c     2
3     d     3
4     e     4

In [6]:
ser01 = pd.Series([1, 2, 3, 4, 5])
ser02 = pd.Series([4, 5, 6, 7, 8])

In [7]:
ser01[ser01.isin(ser02)]

3    4
4    5
dtype: int64

In [8]:
ser01[~ser01.isin(ser02)]

0    1
1    2
2    3
dtype: int64

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(np.random.randint(1, 100, 12))

In [3]:
s

0     85
1     79
2     83
3     88
4     41
5     12
6     64
7     74
8     29
9     56
10     8
11    34
dtype: int32

In [4]:
df = pd.DataFrame(s.values.reshape(4,3), columns=["One", "Two", "Three"])

In [5]:
df

   One  Two  Three
0   85   79     83
1   88   41     12
2   64   74     29
3   56    8     34

In [6]:
df["sum"] = df.sum(axis=1)

In [7]:
df

   One  Two  Three  sum
0   85   79     83  247
1   88   41     12  141
2   64   74     29  167
3   56    8     34   98

In [9]:
df["avg"] = df.mean(axis=1)

In [10]:
df

   One  Two  Three  sum    avg
0   85   79     83  247  123.5
1   88   41     12  141   70.5
2   64   74     29  167   83.5
3   56    8     34   98   49.0

In [13]:
a = pd.Series(range(5))
b = pd.Series(list('abcde'))

In [14]:
a

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [15]:
b

0    a
1    b
2    c
3    d
4    e
dtype: object

In [18]:
c= pd.concat([a, b], axis=1)

c

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [19]:
d = pd.concat([a, b], axis=0)

d

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

In [24]:
f = pd.Series(['how', 'to', 'do', 'the', 'map'])
f

0    how
1     to
2     do
3    the
4    map
dtype: object

In [21]:
f.map(lambda x : x.title())

0    How
1     To
2     Do
3    The
4    Map
dtype: object

In [23]:
f.map(lambda x: x[0].upper()+ x[1:])

0    How
1     To
2     Do
3    The
4    Map
dtype: object

In [30]:
f.map(lambda x: len(x))

0    3
1    2
2    2
3    3
4    3
dtype: int64

In [31]:
words = pd.Series(['apple', 'banana', 'cat', 'dog', 'elephant', 'fish'])

In [32]:
def has_two_vowels(word):
    vowels = 'aeiou'
    count = 0
    
    for char in word:
        if char.lower() in vowels:
            count += 1
            if count >= 2:
                return True
    else:
        return False

In [33]:
filtered_words = words[words.apply(has_two_vowels)]

print(filtered_words)

0       apple
1      banana
4    elephant
dtype: object

In [39]:
type(filtered_words)

pandas.core.series.Series

In [2]:
jerseyNo= pd.Series([7, 10, 18, 45, 48])
jerseyNames = pd.Series(["MSD", "GOD", "KING", "HITMAN", "RAINA"])

In [3]:
df= pd.concat([jerseyNo, jerseyNames], axis=1)
df.columns = ["jerseyNo", "jerseyNames"]

df

   jerseyNo jerseyNames
0         7         MSD
1        10         GOD
2        18        KING
3        45      HITMAN
4        48       RAINA

In [4]:
def func(df):
    return df["jerseyNo"] <= 18

In [5]:
filtered_df = df[df.apply(func, axis=1)]
filtered_df

   jerseyNo jerseyNames
0         7         MSD
1        10         GOD
2        18        KING

In [38]:
data = pd.Series(np.random.randint(1,10,10), pd.date_range('20000101', periods=10))

data

2000-01-01    7
2000-01-02    5
2000-01-03    6
2000-01-04    5
2000-01-05    8
2000-01-06    6
2000-01-07    7
2000-01-08    5
2000-01-09    7
2000-01-10    5
Freq: D, dtype: int32

In [43]:
df = pd.DataFrame(np.arange(20).reshape(-1,5), columns=list("abcde"))

In [44]:
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [49]:
df['a']

0     0
1     5
2    10
3    15
Name: a, dtype: int32

In [56]:
df.loc[:2, ['a', 'd']]

    a   d
0   0   3
1   5   8
2  10  13

In [55]:
df.iloc[:4, [1,2,3]]

    b   c   d
0   1   2   3
1   6   7   8
2  11  12  13
3  16  17  18

In [2]:
df1 = pd.DataFrame(np.arange(20).reshape(-1,5), columns=list("edcba"))

In [4]:
df1

    e   d   c   b   a
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [3]:
df1[sorted(df1.columns)]

    a   b   c   d   e
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

In [5]:
df1.sort_index(ascending=False, axis=1, inplace=True)

In [6]:
df1

    e   d   c   b   a
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [7]:
df = pd.DataFrame([[1, "A"],
                  [2, "B"]],
                 columns=["One", "Two"])

In [8]:
df

   One Two
0    1   A
1    2   B

In [9]:
def f(num):
    return num * 2

In [10]:
df["One"] = df["One"].apply(f)

In [11]:
df

   One Two
0    2   A
1    4   B

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([[1, "A"],
                  [2, "B"],
                  [3, "A"],
                  [4, "C"],
                  [5, "D"]],
                 columns=list('yz'))

In [4]:
df

   y  z
0  1  A
1  2  B
2  3  A
3  4  C
4  5  D

In [6]:
df['z'].unique()

array(['A', 'B', 'C', 'D'], dtype=object)

In [7]:
df['z'].nunique()

4

In [8]:
df.rename(columns={"y":"yyy",
                  "z":"zzz"})

   yyy zzz
0    1   A
1    2   B
2    3   A
3    4   C
4    5   D

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'Group': ['A', 'A', 'B', 'B', 'B', 'C', 'C'],
        'Value': [10, 20, 30, 15, 25, 40, 35]}

In [3]:
df = pd.DataFrame(data)
df

  Group  Value
0     A     10
1     A     20
2     B     30
3     B     15
4     B     25
5     C     40
6     C     35

In [4]:
top_df = df.groupby(["Group"]).agg({"Value":"sum"}).sort_values("Value", ascending=False)

In [5]:
top_df

       Value
Group
C         75
B         70
A         30

In [6]:
data1 = {'Category': ['A', 'A', 'B', 'B'],
        'Subcategory': ['X', 'Y', 'X', 'Y'],
        'Value': [10, 20, 30, 40]}
df1 = pd.DataFrame(data1)
df1

  Category Subcategory  Value
0        A           X     10
1        A           Y     20
2        B           X     30
3        B           Y     40

In [7]:
df1.set_index(["Category", "Subcategory"], inplace=True)

df1

                      Value
Category Subcategory
A        X               10
         Y               20
B        X               30
         Y               40

In [8]:
data3 = {'Category': ['A', 'A', 'B', 'B', 'C', 'C'],
        'Metric': ['X', 'Y', 'X', 'Y', 'X', 'Y'],
        'Value': [10, 20, 30, 40, 50, 60]}
df3 = pd.DataFrame(data3)
df3

  Category Metric  Value
0        A      X     10
1        A      Y     20
2        B      X     30
3        B      Y     40
4        C      X     50
5        C      Y     60

In [9]:
pivoted_df = df3.pivot(index='Category', columns='Metric', values='Value')
pivoted_df

Metric     X   Y
Category
A         10  20
B         30  40
C         50  60

In [10]:
data4 = {'Date': pd.date_range('2022-01-01', periods=10),
        'Value': [10, 15, 20, 25, 30, 35, 40, 45, 50, 55]}
df4 = pd.DataFrame(data4)
df4

        Date  Value
0 2022-01-01     10
1 2022-01-02     15
2 2022-01-03     20
3 2022-01-04     25
4 2022-01-05     30
5 2022-01-06     35
6 2022-01-07     40
7 2022-01-08     45
8 2022-01-09     50
9 2022-01-10     55

In [11]:
data5 = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['London', 'New York', 'Paris', 'Tokyo']}
df5 = pd.DataFrame(data5)
df5

      Name  Age      City
0    Alice   25    London
1      Bob   30  New York
2  Charlie   35     Paris
3    David   40     Tokyo

In [14]:
df5[(df5["Age"] > 30) & (df5["City"] == 'Paris')]

      Name  Age   City
2  Charlie   35  Paris

In [16]:
data6 = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Alice'],
        'Age': [25, 30, 35, 40, 45],
        'City': ['London', 'New York', 'Paris', 'Tokyo', 'London'],
        'Salary': [50000, 60000, 70000, 80000, 90000]}
df6 = pd.DataFrame(data6)
df6

      Name  Age      City  Salary
0    Alice   25    London   50000
1      Bob   30  New York   60000
2  Charlie   35     Paris   70000
3    David   40     Tokyo   80000
4    Alice   45    London   90000

In [19]:
agg_data = df6.groupby('City').agg({'Age':'mean', 'Salary':'sum'})

agg_data

           Age  Salary
City
London    35.0  140000
New York  30.0   60000
Paris     35.0   70000
Tokyo     40.0   80000

In [20]:
data11 = {'Name': ['Alice', 'Bob', 'Charlie'],
         'Age': [25, 30, 35]}
data22 = {'Name': ['Bob', 'David', 'Eve'],
         'City': ['New York', 'Tokyo', 'Paris']}
df11 = pd.DataFrame(data11)
df22 = pd.DataFrame(data22)

In [23]:
df11

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [24]:
df22

    Name      City
0    Bob  New York
1  David     Tokyo
2    Eve     Paris

In [27]:
merged_df = pd.merge(df11, df22, on='Name', how='inner')

merged_df

  Name  Age      City
0  Bob   30  New York

In [28]:
data8 = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['London', 'New York', 'Paris', 'Tokyo']}
df8 = pd.DataFrame(data8)
df8

      Name  Age      City
0    Alice   25    London
1      Bob   30  New York
2  Charlie   35     Paris
3    David   40     Tokyo

In [29]:
def transform(data):
    if data['Age'] < 30:
        return 'Young'
    elif data['Age'] < 40:
        return 'Middle'
    else:
        return 'Old'

In [31]:
df8['Age_Group'] = df8.apply(transform, axis=1)

df8

      Name  Age      City Age_Group
0    Alice   25    London     Young
1      Bob   30  New York    Middle
2  Charlie   35     Paris    Middle
3    David   40     Tokyo       Old

In [1]:
import pandas as pd
import numpy as np

In [2]:
ss = pd.Series([100, 200, 'python', 300.12, 400])
ss

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [5]:
ss_numeric = pd.to_numeric(ss, errors="coerce")
ss_numeric

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [9]:
s = pd.Series([100, 200, 'python', 300.12, 400])
s

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [10]:
to_array = s.values
to_array

array([100, 200, 'python', 300.12, 400], dtype=object)

In [11]:
type(to_array)

numpy.ndarray

In [2]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [3]:
df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [4]:
df["name"] = df["name"].replace('James', 'Suresh')

In [5]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [6]:
df["qualify"] = df["qualify"].map(lambda x : True if x =='yes' else False)

In [7]:
#df["qualify"] = df["qualify"].map({'yes':True, 'no':False})

In [8]:
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [9]:
df_sorted = df.sort_values(by=["name", "score"], ascending=[False, True])

df_sorted

        name  score  attempts  qualify
d     Suresh    NaN         3    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
c  Katherine   16.5         2     True
j      Jonas   19.0         1     True
e      Emily    9.0         2    False
b       Dima    9.0         3    False
a  Anastasia   12.5         1     True

In [10]:
df.loc['k'] = ['Sampath', 10, 2, True]

In [11]:
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True
k    Sampath   10.0         2     True

In [12]:
df.drop(["attempts"], axis=1, inplace=True)

In [13]:
df

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d     Suresh    NaN    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True
k    Sampath   10.0     True

In [14]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red', 'Yellow']
df['color'] = color

In [15]:
df

        name  score  qualify   color
a  Anastasia   12.5     True     Red
b       Dima    9.0    False    Blue
c  Katherine   16.5     True  Orange
d     Suresh    NaN    False     Red
e      Emily    9.0    False   White
f    Michael   20.0     True   White
g    Matthew   14.5     True    Blue
h      Laura    NaN    False   Green
i      Kevin    8.0    False   Green
j      Jonas   19.0     True     Red
k    Sampath   10.0     True  Yellow

In [16]:
df.drop('k', axis=0, inplace=True)

In [17]:
df

        name  score  qualify   color
a  Anastasia   12.5     True     Red
b       Dima    9.0    False    Blue
c  Katherine   16.5     True  Orange
d     Suresh    NaN    False     Red
e      Emily    9.0    False   White
f    Michael   20.0     True   White
g    Matthew   14.5     True    Blue
h      Laura    NaN    False   Green
i      Kevin    8.0    False   Green
j      Jonas   19.0     True     Red

In [18]:
for idx, row in df.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
Suresh nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

In [22]:
cols = list(df.columns.values)
cols

['name', 'score', 'qualify', 'color']

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]})
df

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

In [3]:
nSmallest_col2_df = df.nsmallest(4, "col2")
nSmallest_col2_df

   col1  col2  col3
5    11     0    11
0     1     4     7
1     2     5     5
4     7     5     1

In [4]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])

In [5]:
df = pd.DataFrame(sr1, sr2).reset_index()
df

   index       0
0      1  python
1      2    java
2      3      c#
3      4     c++
4      5     NaN

In [6]:
concat_df = pd.concat([sr1, sr2], axis=1)
concat_df

        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5

In [7]:
dic_df = pd.DataFrame({"col1":sr1, "col2":sr2})
dic_df

     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5

In [6]:
people_df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]})

people_df

             name  age
0  Alberto Franco   18
1    Gino Mcneill   22
2     Ryan Parkes   85
3    Eesha Hinton   50
4    Syed Wharton   80
5   Kierra Gentry    5

In [7]:
people_df["zone"] = people_df["age"].apply(lambda x: "kid" if x <= 18 else("adult" if x <= 35 else("middle" if x <= 50 else "old")))

In [8]:
people_df

             name  age    zone
0  Alberto Franco   18     kid
1    Gino Mcneill   22   adult
2     Ryan Parkes   85     old
3    Eesha Hinton   50  middle
4    Syed Wharton   80     old
5   Kierra Gentry    5     kid

In [8]:
people_df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]})

people_df

             name  age
0  Alberto Franco   18
1    Gino Mcneill   22
2     Ryan Parkes   85
3    Eesha Hinton   50
4    Syed Wharton   80
5   Kierra Gentry    5

In [9]:
people_df["age_groups"] = pd.cut(people_df["age"], bins=[0, 18, 65, 99], labels=["kidz", "adult", "elderly"])
people_df

             name  age age_groups
0  Alberto Franco   18       kidz
1    Gino Mcneill   22      adult
2     Ryan Parkes   85    elderly
3    Eesha Hinton   50      adult
4    Syed Wharton   80    elderly
5   Kierra Gentry    5       kidz

In [10]:
new_record = {
    'name': 'John Doe',
    'age': 30,
    'age_groups': 'adult'
}

In [11]:
people_df = people_df.append(new_record, ignore_index=True)

C:\Users\MSampathVinayKumarRe\AppData\Local\Temp\ipykernel_14980\1061764478.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  people_df = people_df.append(new_record, ignore_index=True)

In [12]:
people_df

             name  age age_groups
0  Alberto Franco   18       kidz
1    Gino Mcneill   22      adult
2     Ryan Parkes   85    elderly
3    Eesha Hinton   50      adult
4    Syed Wharton   80    elderly
5   Kierra Gentry    5       kidz
6        John Doe   30      adult

In [13]:
people_df = people_df.drop(people_df[people_df["name"]=="John Doe"].index)

In [14]:
new_records = [
    {'name': 'John Doe', 'age': 30, 'age_groups': 'adult'},
    {'name': 'Jane Smith', 'age': 25, 'age_groups': 'adult'},
    {'name': 'Alex Johnson', 'age': 60, 'age_groups': 'elderly'}
]

In [15]:
new_people_df = pd.DataFrame(new_records)

people_df = pd.concat([people_df, new_people_df], ignore_index=True)

people_df

             name  age age_groups
0  Alberto Franco   18       kidz
1    Gino Mcneill   22      adult
2     Ryan Parkes   85    elderly
3    Eesha Hinton   50      adult
4    Syed Wharton   80    elderly
5   Kierra Gentry    5       kidz
6        John Doe   30      adult
7      Jane Smith   25      adult
8    Alex Johnson   60    elderly

In [17]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]})

df

             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

In [18]:
df.select_dtypes(include="number")

    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0

In [19]:
df.select_dtypes(include="object")

             name date_of_birth
0  Alberto Franco    17/05/2002
1    Gino Mcneill    16/02/1999
2     Ryan Parkes    25/09/1998
3    Eesha Hinton    11/05/2002
4    Syed Wharton    15/09/1997

In [21]:
df1 = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df1

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

In [23]:
df1.loc[::-1]

    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86

In [26]:
df1.loc[:, ::-1]

    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66

In [33]:
df1.columns = df1.columns.map(lambda x: 'A_' + x)

In [34]:
df1.columns

Index(['A_W', 'A_X', 'A_Y', 'A_Z'], dtype='object')

In [35]:
df1

   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

In [2]:
df = pd.DataFrame({'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]})
df

   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

In [3]:
new_data = [1, 10, 20, 45, 47]
idx = 0

df.insert(loc = idx, column="col1", value=new_data)
df

   col1  col2  col3
0     1     4     7
1    10     5     8
2    20     6    12
3    45     9     1
4    47     5    11

In [4]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

exam_df = pd.DataFrame(exam_data)

exam_df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [5]:
exam_df.sort_values(['attempts', 'score'], ascending=[True, False])

        name  score  attempts qualify
9      Jonas   19.0         1     yes
6    Matthew   14.5         1     yes
0  Anastasia   12.5         1     yes
7      Laura    NaN         1      no
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
8      Kevin    8.0         2      no
5    Michael   20.0         3     yes
1       Dima    9.0         3      no
3      James    NaN         3      no

In [8]:
list(exam_df["score"])

[12.5, 9.0, 16.5, nan, 9.0, 20.0, 14.5, nan, 8.0, 19.0]

#### Grouping and Aggregating Data

In [1]:
import pandas as pd
import numpy as np

In [3]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])


student_data

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [10]:
grouped_df = student_data.groupby(["school_code"]).agg({"age":["mean", "min", "max"]})
grouped_df

              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

In [9]:
grouped_df2 = student_data.groupby(["school_code", "class"]).agg({"weight":"sum"})
grouped_df2

                   weight
school_code class
s001        V          35
            VI         30
s002        V          63
s003        VI         33
s004        VI         32

In [11]:
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

orders_data

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

In [20]:
sales_by_customer = orders_data.groupby(["customer_id"]).agg({"purch_amt":["mean", "min", "max"]})

sales_by_customer.round(2)

            purch_amt
                 mean      min      max
customer_id
3001           270.65   270.65   270.65
3002          2956.95    65.26  5760.00
3003            75.29    75.29    75.29
3004          1983.43  1983.43  1983.43
3005           549.50   150.50   948.50
3007          2400.60  2400.60  2400.60
3008           250.45   250.45   250.45
3009          1295.45   110.50  2480.40

In [24]:
sales_by_customer_sorted = orders_data.groupby(["customer_id"]).agg({"purch_amt":["mean", "min", "max"]}).sort_values(by=("purch_amt","mean"), ascending= False)

sales_by_customer_sorted.round(2)

            purch_amt
                 mean      min      max
customer_id
3002          2956.95    65.26  5760.00
3007          2400.60  2400.60  2400.60
3004          1983.43  1983.43  1983.43
3009          1295.45   110.50  2480.40
3005           549.50   150.50   948.50
3001           270.65   270.65   270.65
3008           250.45   250.45   250.45
3003            75.29    75.29    75.29

In [25]:
dff = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

dff

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3001         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3005         5001
3    70004     110.50  2012-08-17         3001         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3001         5001
6    70008    5760.00  2012-09-10         3005         5001
7    70010    1983.43  2012-10-10         3001         5006
8    70003    2480.40  2012-10-10         3005         5003
9    70012     250.45  2012-06-27         3001         5002
10   70011      75.29  2012-08-17         3005         5007
11   70013    3045.60  2012-04-25         3005         5001

In [30]:
result = dff.groupby(["customer_id"])["ord_date"].apply(list)
result

customer_id
3001    [2012-10-05, 2012-09-10, 2012-08-17, 2012-07-2...
3005    [2012-10-05, 2012-09-10, 2012-09-10, 2012-10-1...
Name: ord_date, dtype: object

In [31]:
result[3001]

['2012-10-05',
 '2012-09-10',
 '2012-08-17',
 '2012-07-27',
 '2012-10-10',
 '2012-06-27']

In [32]:
result[3005]

['2012-10-05',
 '2012-09-10',
 '2012-09-10',
 '2012-10-10',
 '2012-08-17',
 '2012-04-25']

In [35]:
dff["ord_date"] = pd.to_datetime(dff["ord_date"])

solution = dff.groupby([dff["ord_date"].dt.year, dff["ord_date"].dt.month]).agg({"purch_amt":"sum"})

solution

                   purch_amt
ord_date ord_date
2012     4           3045.60
         6            250.45
         7           2400.60
         8            185.79
         9           6979.15
         10          4679.59

In [37]:
df10 = pd.DataFrame({
    'id': [1, 1, 2, 3, 3, 4, 4, 4],
    'value': ['a', 'a', 'b', None, 'a', 'a', None, 'b']
})

df10

   id value
0   1     a
1   1     a
2   2     b
3   3  None
4   3     a
5   4     a
6   4  None
7   4     b

In [38]:
df10.groupby("value")["id"].nunique()

value
a    3
b    2
Name: id, dtype: int64

In [39]:
df11 = pd.DataFrame( {'id' : ['A','A','A','A','A','A','B','B','B','B','B'], 
                    'type' : [1,1,1,1,2,2,1,1,1,2,2], 
                    'book' : ['Math','Math','English','Physics','Math','English','Physics','English','Physics','English','English']})
df11

   id  type     book
0   A     1     Math
1   A     1     Math
2   A     1  English
3   A     1  Physics
4   A     2     Math
5   A     2  English
6   B     1  Physics
7   B     1  English
8   B     1  Physics
9   B     2  English
10  B     2  English

In [47]:
grouped_df11_without_reset_index = df11.groupby(["id", "type"])["book"].apply(list)

grouped_df11_without_reset_index

id  type
A   1       [Math, Math, English, Physics]
    2                      [Math, English]
B   1          [Physics, English, Physics]
    2                   [English, English]
Name: book, dtype: object

In [49]:
type(grouped_df11_without_reset_index)

pandas.core.series.Series

In [48]:
grouped_df11 = df11.groupby(["id", "type"])["book"].apply(list).reset_index()

grouped_df11

  id  type                            book
0  A     1  [Math, Math, English, Physics]
1  A     2                 [Math, English]
2  B     1     [Physics, English, Physics]
3  B     2              [English, English]

In [50]:
type(grouped_df11)

pandas.core.frame.DataFrame

In [3]:
data = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30],
  "qualified": [True, False, False]
}
idx = ["X", "Y", "Z"]

df = pd.DataFrame(data, index=idx)

df

    name  age  qualified
X  Sally   50       True
Y   Mary   40      False
Z   John   30      False

In [4]:
new_df = df.reset_index()

new_df

  index   name  age  qualified
0     X  Sally   50       True
1     Y   Mary   40      False
2     Z   John   30      False

### Joining & Merging

In [1]:
import pandas as pd
import numpy as np

In [2]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [3]:
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [4]:
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [9]:
merged_df = pd.concat([student_data1,student_data2])

merged_df

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [10]:
merged_df.reset_index()

   index student_id              name  marks
0      0         S1  Danniella Fenton    200
1      1         S2      Ryder Storey    210
2      2         S3      Bryce Jensen    190
3      3         S4         Ed Bernal    222
4      4         S5       Kwame Morin    199
5      0         S4  Scarlette Fisher    201
6      1         S5  Carla Williamson    200
7      2         S6       Dante Morse    198
8      3         S7    Kaiser William    219
9      4         S8   Madeeha Preston    201

In [11]:
student_data11 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data22 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [12]:
merged_on_axis1 = pd.concat([student_data11, student_data22], axis=1)
merged_on_axis1

  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton    200         S4  Scarlette Fisher    201
1         S2      Ryder Storey    210         S5  Carla Williamson    200
2         S3      Bryce Jensen    190         S6       Dante Morse    198
3         S4         Ed Bernal    222         S7    Kaiser William    219
4         S5       Kwame Morin    199         S8   Madeeha Preston    201

In [9]:
import pandas as pd
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})

print(data1)
print(data2)

merged_data = pd.merge(data1, data2, on=['key1', 'key2'])
print(merged_data)

  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3
  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3
  key1 key2   P   Q   R   S
0   K0   K0  P0  Q0  R0  S0
1   K1   K0  P2  Q2  R1  S1
2   K1   K0  P2  Q2  R2  S2

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}


regiment_df = pd.DataFrame(raw_data)
regiment_df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [3]:
regiment_df.groupby(["regiment"]).agg({"preTestScore":"sum", "postTestScore":"sum"})

            preTestScore  postTestScore
regiment
Dragoons              62            246
Nighthawks            61            238
Scouts                10            264

In [7]:
# mean values for "Nighthawks" particularly

In [5]:
regiment_df[regiment_df["regiment"]=='Nighthawks'].groupby("regiment").mean()

            preTestScore  postTestScore
regiment
Nighthawks         15.25           59.5

In [9]:
regiment_df.groupby(['regiment', 'company']).preTestScore.mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

In [11]:
regiment_df.groupby(['regiment', 'company']).preTestScore.mean().reset_index()

     regiment company  preTestScore
0    Dragoons     1st           3.5
1    Dragoons     2nd          27.5
2  Nighthawks     1st          14.0
3  Nighthawks     2nd          16.5
4      Scouts     1st           2.5
5      Scouts     2nd           2.5

In [13]:
regiment_df.groupby(['regiment', 'company']).preTestScore.mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

In [1]:
import pandas as pd
import numpy as np
location = "C:\\Users\\MSampathVinayKumarRe\\Desktop\\Python\\DSA\\data\\Automobile_data.csv"

In [2]:
df = pd.read_csv(location)
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [3]:
df

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...,...
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [4]:
df.groupby(["company", "body-style"]).agg({"price":"sum"})

                              price
company       body-style
alfa-romero   convertible   29995.0
              hatchback     16500.0
audi          sedan         46650.0
              wagon         18920.0
bmw           sedan        163280.0
chevrolet     hatchback     11446.0
              sedan          6575.0
dodge         hatchback     12606.0
honda         sedan         23290.0
              wagon          7295.0
isuzu         sedan          6785.0
jaguar        sedan        103800.0
mazda         hatchback     29930.0
              sedan         18344.0
mercedes-benz hardtop       45400.0
              sedan         66512.0
              wagon         28248.0
mitsubishi    hatchback     11578.0
              sedan         15178.0
nissan        sedan         34096.0
              wagon          7349.0
porsche       convertible   37028.0
              hardtop       34028.0
              hatchback         0.0
toyota        hatchback     18174.0
              wagon         39344.0
volkswagen    sedan         33740.0
volvo         sedan         12940.0
              wagon         13415.0

In [7]:
df.groupby(["body-style"]).agg({"price":"sum"}).sort_values(by=["price"], ascending=False)

                price
body-style
sedan        531190.0
wagon        114571.0
hatchback    100234.0
hardtop       79428.0
convertible   67023.0

In [8]:
df[["company", "price"]][df["price"]==df["price"].max()]

          company    price
35  mercedes-benz  45400.0

In [10]:
df[df["company"]=="toyota"]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

In [15]:
df["company"].value_counts()

toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
isuzu            3
jaguar           3
porsche          3
dodge            2
volvo            2
Name: company, dtype: int64

In [23]:
df.groupby(["company"]).agg(no_of_cars=("company", "count")).sort_values("no_of_cars", ascending=False)

               no_of_cars
company
toyota                  7
bmw                     6
mazda                   5
nissan                  5
audi                    4
mercedes-benz           4
mitsubishi              4
volkswagen              4
alfa-romero             3
chevrolet               3
honda                   3
isuzu                   3
jaguar                  3
porsche                 3
dodge                   2
volvo                   2

In [28]:
#company and its costliest car
df.groupby("company")["price"].max().reset_index()

          company    price
0     alfa-romero  16500.0
1            audi  18920.0
2             bmw  41315.0
3       chevrolet   6575.0
4           dodge   6377.0
5           honda  12945.0
6           isuzu   6785.0
7          jaguar  36000.0
8           mazda  18344.0
9   mercedes-benz  45400.0
10     mitsubishi   8189.0
11         nissan  13499.0
12        porsche  37028.0
13         toyota  15750.0
14     volkswagen   9995.0
15          volvo  13415.0

In [30]:
idx = df.groupby("company")["price"].idxmax()
idx

company
alfa-romero       1
audi              6
bmw              11
chevrolet        15
dodge            16
honda            19
isuzu            21
jaguar           26
mazda            31
mercedes-benz    35
mitsubishi       39
nissan           44
porsche          46
toyota           54
volkswagen       58
volvo            60
Name: price, dtype: int64

In [32]:
highest_prices_df = df.loc[idx, ["company", "body-style", "price"]]
highest_prices_df

          company   body-style    price
1     alfa-romero  convertible  16500.0
6            audi        wagon  18920.0
11            bmw        sedan  41315.0
15      chevrolet        sedan   6575.0
16          dodge    hatchback   6377.0
19          honda        sedan  12945.0
21          isuzu        sedan   6785.0
26         jaguar        sedan  36000.0
31          mazda        sedan  18344.0
35  mercedes-benz      hardtop  45400.0
39     mitsubishi        sedan   8189.0
44         nissan        sedan  13499.0
46        porsche  convertible  37028.0
54         toyota        wagon  15750.0
58     volkswagen        sedan   9995.0
60          volvo        wagon  13415.0

In [42]:
def currPrevSum(nums):
    prev = 0
    for i in range(nums):
        sol = prev + i
        print("previous num is {}, present num is {} and the sum is {}".format(prev, i, sol))
        prev = i

In [43]:
currPrevSum(10)

previous num is 0, present num is 0 and the sum is 0
previous num is 0, present num is 1 and the sum is 1
previous num is 1, present num is 2 and the sum is 3
previous num is 2, present num is 3 and the sum is 5
previous num is 3, present num is 4 and the sum is 7
previous num is 4, present num is 5 and the sum is 9
previous num is 5, present num is 6 and the sum is 11
previous num is 6, present num is 7 and the sum is 13
previous num is 7, present num is 8 and the sum is 15
previous num is 8, present num is 9 and the sum is 17

In [46]:
string = "pynative"

In [51]:
for i in range(len(string)):
    if i % 2 == 0:
        print(string[i], end= " ")

p n t v

In [50]:
for i in range(0, len(string), 2):
    print(string[i], end = " ")

p n t v

In [59]:
def removeChars(str_, index):
    print(str_[index:])

In [60]:
removeChars("sampath", 3)

path

In [1]:
str_x = "Emma is good developer. Emma is a writer"

In [66]:
str_x.count("Emma")

2

In [1]:
list1 = [10, 20, 25, 30, 35]
list2 = [40, 45, 60, 75, 90]

In [2]:
odd_list = [num for num in list1 + list2 if num % 2 != 0]
odd_list

[25, 35, 45, 75]

In [4]:
even_odd_list = [num for num in list1 if num % 2 == 0] + [num for num in list2 if num % 2 != 0]
even_odd_list

[10, 20, 30, 45, 75]

##### Tax Calculator

In [9]:
def taxCalculator(income):
    tax_payable = 0
    
    if income <= 10000:
        tax_payable = 0
    
    elif income <= 20000:
        x = income - 10000
        tax_payable = x * 10/100
        
    else:
        tax_payable = 0 
        tax_payable = 10000 * 10 / 100
        tax_payable = tax_payable + (income - 20000) * 20 / 100
        
    return tax_payable

In [10]:
taxCalculator(450000)

87000.0

In [20]:
n = 6
while n:
    print(n)
    n -= 1

6
5
4
3
2
1

In [23]:
n = 6
i = 1
while i <= n:
    print(i)
    i += 1

1
2
3
4
5
6

In [29]:
n = 2

for i in range(1, 11):
    print(i * n)

2
4
6
8
10
12
14
16
18
20

In [30]:
list1 = [10, 20, 30, 40, 50]

In [56]:
for i in range(len(list1)-1, -1, -1):
    print(list1[i])

50
40
30
20
10

In [60]:
for num in range(-10, 0, 1):
    print(num)
print("Done")

-10
-9
-8
-7
-6
-5
-4
-3
-2
-1
Done

In [64]:
for num in range(1, 51):
    for i in range(2, num):
        if num % i == 0:
            break
    else:
        print(num)

1
2
3
5
7
11
13
17
19
23
29
31
37
41
43
47